#ifndef SUBJECT_H
#define SUBJECT_H

/*Направете клас Subject, който има следните данни: статичен указател към University(от предното упражнение), 
масив от входящи номера на студенти. 
Да се напишат:

- статичен метод за добавяне нa задаване на указателя към University;
- метод за добавяне на входящ номер на студент;
- статичен метод който принтира номерата и имената на всички студенти които нямат записана дисциплина;
- оperator[], който връща студента отговарящ на i-я добавен входящ номер;*/
class Subject
{
public:
};

#endif